БухЭксп/Documents/CW_КорректировкаРаспределенияОплатДляУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаРаспределенияОплатДляУСН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_ОплатыПокупателейУСН</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАванса</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДЕ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговору</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоговорыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоговорыПоГрузоперевозкам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШаблонПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодставлятьПодписиИПечатьПриЭлектроннойРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриложенияВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиАктов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиАктов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаРаспределенияОплатДляУСН/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	// ---------------------------------------------------------------------------- 
	
	_ПраваДоступа();
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	_УправлениеЭлементамиФормы();
	
	_СформироватьЗаголовок();
	КонтрольСуммыСтрок();
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

Функция _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// --- 
КонецФункции
  

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	// --- 
	
	// --- 
КонецПроцедуры

// --- 

Процедура НомерПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	_СформироватьЗаголовок();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_СформироватьЗаголовок();
	КонтрольСуммыСтрок();
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Функция КонтрольСуммыСтрок()
	// --- 
	
	Для каждого Стр Из Объект.ТаблицаКорректировки Цикл
		
		Стр.СуммаРаспределения = Стр.СуммаДУ + Стр.СуммаДК + Стр.СуммаДЕ;
		
	КонецЦикла; 
	
	// --- 
КонецФункции
 

&НаСервере
Функция _СформироватьЗаголовок()
	// --- 
	
	// --- 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТаблицаКорректировкиСуммаПриИзменении(Элемент)
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДУПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);	
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДКПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКорректировкиСуммаДЕПриИзменении(Элемент)
	
	СуммаРаспределения(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРаспределения(Элемент)
	// --- 
	
	ТД = Элементы.ТаблицаКорректировки.ТекущиеДанные;
	Если (ТД <> Неопределено) Тогда
		
		ТД.СуммаРаспределения = ТД.СуммаДУ + ТД.СуммаДК + ТД.СуммаДЕ;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗаполнитьПоДаннымБУ(Команда)
	
	_ЗаполнитьПоДаннымБУ();
	
КонецПроцедуры

&НаСервере
Процедура _ЗаполнитьПоДаннымБУ()
	
	Счета = CW_Конфигурация.ПланСчетов();
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученным);
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымВал);
	МассивСчетов.Добавить(Счета.РасчетыПоАвансамПолученнымУЕ);
	
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_Рубли"));
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_Валюта"));
	_сф.м_ДобавитьУникально(МассивСчетов,CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "СчетРасчетов_Клиенты_УЕ"));

	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка,
	               |	CW_ДоговорыПоГрузоперевозкам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_ДоговорыПоГрузоперевозкам
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПриложенияКДоговорам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_УчетныеДоговораПриложений
	               |ИЗ
	               |	Справочник.CW_ПриложенияКДоговорам КАК CW_ПриложенияКДоговорам
	               |ГДЕ
	               |	CW_ПриложенияКДоговорам.Договор В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_ДоговорыПоГрузоперевозкам КАК ВТ_ДоговорыПоГрузоперевозкам)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоговорыПоГрузоперевозкам.УчетныйДоговор КАК УчетныйДоговор
	               |ПОМЕСТИТЬ ВТ_УчетныеДоговора
	               |ИЗ
	               |	ВТ_ДоговорыПоГрузоперевозкам КАК ВТ_ДоговорыПоГрузоперевозкам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_УчетныеДоговораПриложений.УчетныйДоговор
	               |ИЗ
	               |	ВТ_УчетныеДоговораПриложений КАК ВТ_УчетныеДоговораПриложений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	               |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	               |	ХозрасчетныйОстатки.Субконто3 КАК ДокументОплаты,
	               |	ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаДокументаОплаты,
	               |	ХозрасчетныйОстатки.Счет КАК СчетАванса,
	               |	-ХозрасчетныйОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Остатки(
	               |			&Период,
	               |			Счет В (&Счета),
	               |			&Субконто,
	               |			Организация = &Организация
	               |				И Субконто2 В
	               |					(ВЫБРАТЬ
	               |						ВТ_УчетныеДоговора.УчетныйДоговор КАК УчетныйДоговор
	               |					ИЗ
	               |						ВТ_УчетныеДоговора КАК ВТ_УчетныеДоговора)) КАК ХозрасчетныйОстатки
	               |ГДЕ
	               |	-ХозрасчетныйОстатки.СуммаОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаДокументаОплаты
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Период", 		Объект.Дата);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Счета", 			МассивСчетов);
	Запрос.УстановитьПараметр("Субконто", 		Субконто);
	
	РезультатЗпроса = Запрос.Выполнить();
	Выборка = РезультатЗпроса.Выбрать();
	
	Объект.ТаблицаКорректировки.Очистить();

	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ТаблицаКорректировки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.СуммаДК 			= Выборка.Сумма;
		НоваяСтрока.СуммаРаспределения 	= Выборка.Сумма; 
		
	КонецЦикла;

	
КонецПроцедуры
 
// --- 

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	// --- 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиДоговорПриИзменении(Элемент)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииДоговораВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКорректировкиКонтрагентПриИзменении(Элемент)
	
	////Подсистема.УчетПриложенийДоговоров
	//CW_УчетПриложенийДоговоровКлиентСервер.ПриИзмененеииКонтрагентаВСтрокеТабличнойЧасти(ЭтаФорма, "ТаблицаКорректировки");
	////Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти
